[
    {
        "title": "Self-organized criticality: An explanation of the 1/<i>f</i>noise",
        "abstract": "We show that dynamical systems with spatial degrees of freedom naturally evolve into a self-organized critical point. Flicker noise, or 1/f noise, can be identified with the dynamics of the critical state. This picture also yields insight into the origin of fractal objects."
    },
    {
        "title": "Identification and control of dynamical systems using neural networks",
        "abstract": "It is demonstrated that neural networks can be used effectively for the identification and control of nonlinear dynamical systems. The emphasis is on models for both identification and control. Static and dynamic backpropagation methods for the adjustment of parameters are discussed. In the models that are introduced, multilayer and recurrent networks are interconnected in novel configurations, and hence there is a real need to study them in a unified fashion. Simulation results reveal that the identification and adaptive control schemes suggested are practically feasible. Basic concepts and definitions are introduced throughout, and theoretical questions that have to be addressed are also described."
    },
    {
        "title": "Geometry from a Time Series",
        "abstract": "It is shown how the existence of low-dimensional chaotic dynamical systems describing turbulent fluid flow might be determined experimentally. Techniques are outlined for reconstructing phase-space pictures from the observation of a single coordinate of any dissipative dynamical system, and for determining the dimensionality of the system's attractor. These techniques are applied to a well-known simple three-dimensional chaotic dynamical system."
    },
    {
        "title": "Real-Time Computing Without Stable States: A New Framework for Neural Computation Based on Perturbations",
        "abstract": "A key challenge for neural modeling is to explain how a continuous stream of multimodal input from a rapidly changing environment can be processed by stereotypical recurrent circuits of integrate-and-fire neurons in real time. We propose a new computational model for real-time computing on time-varying input that provides an alternative to paradigms based on Turing machines or attractor neural networks. It does not require a task-dependent construction of neural circuits. Instead, it is based on principles of high-dimensional dynamical systems in combination with statistical learning theory and can be implemented on generic evolved or found recurrent circuitry. It is shown that the inherent transient dynamics of the high-dimensional dynamical system formed by a sufficiently large and heterogeneous neural circuit may serve as universal analog fading memory. Readout neurons can learn to extract in real time from the current state of such recurrent neural circuit information about current and past inputs that may be needed for diverse tasks. Stable internal states are not required for giving a stable output, since transient internal states can be transformed by readout neurons into stable target outputs due to the high dimensionality of the dynamical system. Our approach is based on a rigorous computational model, the liquid state machine, that, unlike Turing machines, does not require sequential transitions between well-defined discrete internal states. It is supported, as the Turing machine is, by rigorous mathematical results that predict universal computational power under idealized conditions, but for the biologically more realistic scenario of real-time processing of time-varying inputs. Our approach provides new perspectives for the interpretation of neural coding, the design of experiments and data analysis in neurophysiology, and the solution of problems in robotics and neurotechnology."
    },
    {
        "title": "Neural networks and fuzzy systems: a dynamical systems approach to machine intelligence",
        "abstract": "This work combines neural networks and fuzzy systems, presenting neural networks as trainable dynamical systems and developing mechanisms and principles of adaption, self-organization, convergence and global stability. It includes the new geometric theory of fuzzy sets, systems and associated memories, and shows how to apply fuzzy set theory to adaptive control and how to generate structured fuzzy systems with unsupervised neural techniques."
    },
    {
        "title": "The dynamical hypothesis in cognitive science",
        "abstract": "According to the dominant computational approach in cognitive science, cognitive agents are digital computers; according to the alternative approach, they are dynamical systems. This target article attempts to articulate and support the dynamical hypothesis. The dynamical hypothesis has two major components: the nature hypothesis (cognitive agents are dynamical systems) and the knowledge hypothesis (cognitive agents can be understood dynamically). A wide range of objections to this hypothesis can be rebutted. The conclusion is that cognitive systems may well be dynamical systems, and only sustained empirical research in cognitive science will determine the extent to which that is true."
    },
    {
        "title": "Controlling Hyperchaos",
        "abstract": "For a finite-dimensional dynamical system, whose governing equations may or may not be analytically available, we show how to stabilize an unstable orbit in a neighborhood of a \"fully\"unstable fixed point (i.e., a fixed point at which all eigenvalues of the Jacobian matrix have modulus greater than unity). Only one of the unstable directions is to be stabilized via time-dependent adjustments of control parameters. The parameter adjustments can be optimized."
    },
    {
        "title": "Frontiers in complex dynamics",
        "abstract": "Rational maps on the Riemann sphere occupy a distinguished niche in the general theory of smooth dynamical systems. First, rational maps are complexanalytic, so a broad spectrum of techniques can contribute to their study (quasiconformal mappings, potential theory, algebraic geometry, etc.) The rational maps of a given degree form a finite dimensional manifold, so exploration of this parameter space is especially tractable. Finally, some of the conjectures once proposed for smooth dynamical systems (and now known to be false), seem to have a definite chance of holding in the arena of rational maps. In this article we survey a small constellation of such conjectures, centering around the density of hyperbolic rational maps — those which are dynamically the best behaved. We discuss some of the evidence and logic underlying these conjectures, and sketch recent progress towards their resolution."
    },
    {
        "title": "Industrial applications of fuzzy logic at General Electric",
        "abstract": "Fuzzy logic control (FLC) technology has drastically reduced the development time and deployment cost for the synthesis of nonlinear controllers for dynamic systems. As a result we have experienced an increased number of FLC applications. We illustrate some of our efforts in FLC technology transfer, covering projects in turboshaft aircraft engine control, steam turbine startup, steam turbine cycling optimization, resonant converter power supply control, and data-induced modeling of the nonlinear relationship between process variables in a rolling mill stand. We compare these applications in a cost/complexity framework, and examine the driving factors that led to the use of FLCs in each application. We emphasize the role of fuzzy logic in developing supervisory controllers and in maintaining explicit tradeoff criteria used to manage multiple control strategies. Finally, we describe some of our FLC technology research efforts in automatic rule base tuning and generation, leading to a suite of programs for reinforcement learning, supervised learning, genetic algorithms, steepest descent algorithms, and rule clustering.< <ETX xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">&gt;</ETX>"
    },
    {
        "title": "Exploring Robotic Minds",
        "abstract": "Abstract How do “minds” work? In Exploring Robotic Minds: Actions, Symbols, and Consciousness as Self-Organizing Dynamic Phenomena, Professor Jun Tani reviews key experiments within his own pioneering neurorobotics research project aimed at answering this fundamental and fascinating question. The book shows how symbols and concepts representing the world can emerge via “deep learning” within robots, by using specially designed neural network architectures by which, given iterative interactions between top-down proactive “subjective” and “intentional” processes for plotting action, and bottom-up updates of the perceptual reality after action, the robot is able to learn to isolate, to identify, and even to infer salient features of the operational environment, modifying its behavior based on anticipations of both objective and social cues. Through permutations of this experimental model, the book then argues that longstanding questions about the nature of “consciousness” and “freewill” can be addressed through an understanding of the dynamic structures within which, in the course of normal operations and in a changing operational environment, necessary top-down/bottom-up interactions arise. Written in clear and accessible language, this book opens a privileged window for a broad audience onto the science of artificial intelligence and the potential for artificial consciousness, threading cognitive neuroscience, dynamic systems theory, robotics, and phenomenology through an elegant series of deceptively simple experiments that build upon one another and ultimately outline the fundamental form of the working mind."
    },
]